Revit 2026 API

# LightFamily Properties

---

The LightFamily type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

LightFamily Class

Autodesk.Revit.DB.Lighting Namespace